`timescale 1ns / 1ps
//////////////////////////////////////////////////////////////////////////////////
// Company: 
// Engineer: 
// 
// Create Date: 2022/02/07 22:34:41
// Design Name: 
// Module Name: Clk_Div_Ms_S
// Project Name: 
// Target Devices: 
// Tool Versions: 
// Description: 
// 
// Dependencies: 
// 
// Revision:
// Revision 0.01 - File Created
// Additional Comments:
// 
//////////////////////////////////////////////////////////////////////////////////


module Clk_Div_Ms_S(
input clk,
input rst_l,
output  clk_1ms,
output  clk_10ms,
output  clk_100ms,
output  clk_1s,
output  clk_10s
);
//输入：clk：输入的系统时钟，
/*输出：clk_1ms：输出系统时钟分频后的周期1ms的时钟脉冲,clk_10ms：输出系统时钟分频后的周期10ms的时钟脉冲,clk_100ms：输出系统时钟分频后的周期100ms的时钟脉冲,
        clk_1s：输出系统时钟分频后的周期1s的时钟脉冲, clk_10s：输出系统时钟分频后的周期10s的时钟脉冲, */
//功能：将系统时钟脉冲：倍频成周期为1ms，在10倍频得到新的时钟脉冲

 //*******************************************loginc Implementation（程序逻辑实现）***********************************************//
	 //$$$$$$$$$$$$$$$（ 1ms倍频 模块调用）$$$$$$$$$$$$$$$$$$// 
	       //模块调用：
	               clk_div_ms  T_1ms(clk,rst_l,clk_1ms);
    //#################（ 模块结束）#################//    
    
    
    //$$$$$$$$$$$$$$$（ 10ms倍频 模块调用）$$$$$$$$$$$$$$$$$$// 
	       //模块调用：
	              clk_div10  T_10ms(clk_1ms,rst_l,clk_10ms);
    //#################（ 模块结束）#################//    
    
    
    //$$$$$$$$$$$$$$$（ 100ms倍频 模块调用）$$$$$$$$$$$$$$$$$$// 
	       //模块调用：
	               clk_div10  T_100ms(clk_10ms,rst_l,clk_100ms);
    //#################（ 模块结束）#################//    
    
    
    //$$$$$$$$$$$$$$$（ 1s倍频 模块调用）$$$$$$$$$$$$$$$$$$// 
	       //模块调用：
	               clk_div10  T_1s(clk_100ms,rst_l,clk_1s);

    //#################（ 模块结束）#################//    
    
    
    //$$$$$$$$$$$$$$$（ 10s倍频 模块调用）$$$$$$$$$$$$$$$$$$// 
	       //模块调用：
	              clk_div10  T_10s(clk_1s,rst_l,clk_10s);
    //#################（ 模块结束）#################//    

endmodule


